Repository: EightBitEllie/Penny-Dreadful-Tools
Catalog: decksite/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Rotation Tracking
es: Estado de la Rotación

source: Rotation Changes
es: Cambios

source: Rotation Speculation
es: Especulación

source: External Links
es: Enlaces Externos

source: Log Out
es: Cerrar Sesión

source: Metagame
es: Metajuego

source: Latest Decks
es: Mazos Recientes

source: Archetypes
es: Arquetipos

source: People
es: Personas

source: Cards
es: Cartas

source: Past Seasons
es: Anteriores Temporadas

source: League
es: Liga

source: League Info
es: Información de la Liga

source: Sign Up
es: Registro

source: Report
es: Resultado

source: Records
es: Resultados

source: Retire
es: Abandonar

source: Competitions
es: Competiciones

source: Competition Results
es: Resultados de las Competiciones

source: Tournament Info
es: Información de los Torneos

source: Leaderboards
es: Clasificación

source: Hosting
es: Organizar

source: Resources
es: Recursos

source: About
es: Acerca de

source: What is Penny Dreadful?
es: ¿Qué es Penny Dreadful?

source: About pennydreadfulmagic.com
es: Acerca de pennydreadfulmagic.com

source: League Results
es: Resultados de la Liga
